SlugSat/3HC/3HC_Firmware/3HC_Firmware_0_1.cydsn/Generated_Source/PSoC5/ADC_CURR_SENSE.c
    /* Initialize the registers with default customizer settings for config1 */
    ADC_CURR_SENSE_InitConfig(ADC_CURR_SENSE_Config);
}


/******************************************************************************
* Function Name: ADC_CURR_SENSE_Enable
*******************************************************************************
*
* Summary:
*  Enables the ADC DelSig block operation.
*
* Parameters:
*  None
*
* Return:
*  None
*
* Side Effects: 
*  Enables internal interrupt.
*
*******************************************************************************/
void ADC_CURR_SENSE_Enable(void) 
{
	uint8 config;
    uint8 enableInterrupts;
    enableInterrupts = CyEnterCriticalSection();

    /* Read volatile variable to the local variable */
    config = ADC_CURR_SENSE_Config;
    
    /* Enable active mode power for ADC */
    ADC_CURR_SENSE_PWRMGR_DEC_REG |= ADC_CURR_SENSE_ACT_PWR_DEC_EN;
    ADC_CURR_SENSE_PWRMGR_DSM_REG |= ADC_CURR_SENSE_ACT_PWR_DSM_EN;

     /* Enable alternative active mode power for ADC */
    ADC_CURR_SENSE_STBY_PWRMGR_DEC_REG |= ADC_CURR_SENSE_STBY_PWR_DEC_EN;
    ADC_CURR_SENSE_STBY_PWRMGR_DSM_REG |= ADC_CURR_SENSE_STBY_PWR_DSM_EN;

    /* Disable PRES, Enable power to VCMBUF0, REFBUF0 and REFBUF1, enable PRES */
    ADC_CURR_SENSE_RESET_CR4_REG |= ADC_CURR_SENSE_IGNORE_PRESA1;
    ADC_CURR_SENSE_RESET_CR5_REG |= ADC_CURR_SENSE_IGNORE_PRESA2;

    ADC_CURR_SENSE_DSM_CR17_REG |= (ADC_CURR_SENSE_DSM_EN_BUF_VREF | ADC_CURR_SENSE_DSM_EN_BUF_VCM);

    /* Code to disable the REFBUF0 if reference chosen is External ref */
    #if (((ADC_CURR_SENSE_CFG1_REFERENCE == ADC_CURR_SENSE_EXT_REF_ON_P03) || \
          (ADC_CURR_SENSE_CFG1_REFERENCE == ADC_CURR_SENSE_EXT_REF_ON_P32)) || \
         ((ADC_CURR_SENSE_DEFAULT_NUM_CONFIGS > 1) && \
          ((ADC_CURR_SENSE_CFG2_REFERENCE == ADC_CURR_SENSE_EXT_REF_ON_P03) ||  \
           (ADC_CURR_SENSE_CFG2_REFERENCE == ADC_CURR_SENSE_EXT_REF_ON_P32))) || \
         ((ADC_CURR_SENSE_DEFAULT_NUM_CONFIGS > 2) && \
          ((ADC_CURR_SENSE_CFG3_REFERENCE == ADC_CURR_SENSE_EXT_REF_ON_P03) ||  \
           (ADC_CURR_SENSE_CFG3_REFERENCE == ADC_CURR_SENSE_EXT_REF_ON_P32))) || \
         ((ADC_CURR_SENSE_DEFAULT_NUM_CONFIGS > 3) && \
          ((ADC_CURR_SENSE_CFG4_REFERENCE == ADC_CURR_SENSE_EXT_REF_ON_P03) || \
           (ADC_CURR_SENSE_CFG4_REFERENCE == ADC_CURR_SENSE_EXT_REF_ON_P32))))
        if (((config == 1u) &&
            ((ADC_CURR_SENSE_CFG1_REFERENCE == ADC_CURR_SENSE_EXT_REF_ON_P03) ||
             (ADC_CURR_SENSE_CFG1_REFERENCE == ADC_CURR_SENSE_EXT_REF_ON_P32))) ||
            ((config == 2u) &&
            ((ADC_CURR_SENSE_CFG2_REFERENCE == ADC_CURR_SENSE_EXT_REF_ON_P03) ||
             (ADC_CURR_SENSE_CFG2_REFERENCE == ADC_CURR_SENSE_EXT_REF_ON_P32))) ||
            ((config == 3u) &&
            ((ADC_CURR_SENSE_CFG3_REFERENCE == ADC_CURR_SENSE_EXT_REF_ON_P03) ||
             (ADC_CURR_SENSE_CFG3_REFERENCE == ADC_CURR_SENSE_EXT_REF_ON_P32))) ||
            ((config == 4u) &&
            ((ADC_CURR_SENSE_CFG4_REFERENCE == ADC_CURR_SENSE_EXT_REF_ON_P03) ||
             (ADC_CURR_SENSE_CFG4_REFERENCE == ADC_CURR_SENSE_EXT_REF_ON_P32))))
        {
            /* Disable the REFBUF0 */
            ADC_CURR_SENSE_DSM_CR17_REG &= (uint8)~ADC_CURR_SENSE_DSM_EN_BUF_VREF;
        }
    #endif /* External ref */

    #if (((ADC_CURR_SENSE_CFG1_INPUT_RANGE == ADC_CURR_SENSE_IR_VSSA_TO_2VREF) || \
         ((ADC_CURR_SENSE_DEFAULT_NUM_CONFIGS > 1) && \
          (ADC_CURR_SENSE_CFG2_INPUT_RANGE == ADC_CURR_SENSE_IR_VSSA_TO_2VREF)) || \
         ((ADC_CURR_SENSE_DEFAULT_NUM_CONFIGS > 2) && \
          (ADC_CURR_SENSE_CFG3_INPUT_RANGE == ADC_CURR_SENSE_IR_VSSA_TO_2VREF)) || \
         ((ADC_CURR_SENSE_DEFAULT_NUM_CONFIGS > 3) && \
          (ADC_CURR_SENSE_CFG4_INPUT_RANGE == ADC_CURR_SENSE_IR_VSSA_TO_2VREF))))
        if(((config == 1u) &&
            (ADC_CURR_SENSE_CFG1_INPUT_RANGE == ADC_CURR_SENSE_IR_VSSA_TO_2VREF) &&
            ((ADC_CURR_SENSE_CFG1_REFERENCE != ADC_CURR_SENSE_EXT_REF_ON_P03) &&
             (ADC_CURR_SENSE_CFG1_REFERENCE != ADC_CURR_SENSE_EXT_REF_ON_P32))) ||
             ((config == 2u) &&
              (ADC_CURR_SENSE_CFG2_INPUT_RANGE == ADC_CURR_SENSE_IR_VSSA_TO_2VREF) &&
             ((ADC_CURR_SENSE_CFG2_REFERENCE != ADC_CURR_SENSE_EXT_REF_ON_P03) &&
             (ADC_CURR_SENSE_CFG2_REFERENCE != ADC_CURR_SENSE_EXT_REF_ON_P32))) ||
             ((config == 3u) &&
              (ADC_CURR_SENSE_CFG3_INPUT_RANGE == ADC_CURR_SENSE_IR_VSSA_TO_2VREF) &&
             ((ADC_CURR_SENSE_CFG3_REFERENCE != ADC_CURR_SENSE_EXT_REF_ON_P03) &&
             (ADC_CURR_SENSE_CFG3_REFERENCE != ADC_CURR_SENSE_EXT_REF_ON_P32))) ||
             ((config == 4u) &&
              (ADC_CURR_SENSE_CFG4_INPUT_RANGE == ADC_CURR_SENSE_IR_VSSA_TO_2VREF) &&
             ((ADC_CURR_SENSE_CFG4_REFERENCE != ADC_CURR_SENSE_EXT_REF_ON_P03) &&
             (ADC_CURR_SENSE_CFG4_REFERENCE != ADC_CURR_SENSE_EXT_REF_ON_P32))))
        {
            /* Enable the REFBUF1 */
            ADC_CURR_SENSE_DSM_REF0_REG |= ADC_CURR_SENSE_DSM_EN_BUF_VREF_INN;
        }
    #endif /* VSSA_TO_2VREF */
    if(config != 0u)
    {
        /* Suppress compiler warning */
    }

    /* Wait for 3 microseconds */
    CyDelayUs(ADC_CURR_SENSE_PRES_DELAY_TIME);

    /* Enable the press circuit */
    ADC_CURR_SENSE_RESET_CR4_REG &= (uint8)~ADC_CURR_SENSE_IGNORE_PRESA1;
    ADC_CURR_SENSE_RESET_CR5_REG &= (uint8)~ADC_CURR_SENSE_IGNORE_PRESA2;

    /* Enable negative pumps for DSM  */
    ADC_CURR_SENSE_PUMP_CR1_REG  |= ( ADC_CURR_SENSE_PUMP_CR1_CLKSEL | ADC_CURR_SENSE_PUMP_CR1_FORCE );

    /* Enable Modulator Chopping if required */
    ADC_CURR_SENSE_DSM_CR2_REG = ADC_CURR_SENSE_CFG1_DSM_CR2;

    /* This is only valid if there is an internal clock */
    #if(ADC_CURR_SENSE_DEFAULT_INTERNAL_CLK)
        ADC_CURR_SENSE_PWRMGR_CLK_REG |= ADC_CURR_SENSE_ACT_PWR_CLK_EN;
        ADC_CURR_SENSE_STBY_PWRMGR_CLK_REG |= ADC_CURR_SENSE_STBY_PWR_CLK_EN;
    #endif /* ADC_CURR_SENSE_DEFAULT_INTERNAL_CLK */

