SlugSat/3HC/3HC_Firmware/3HC_Firmware_0_1.cydsn/Generated_Source/PSoC5/ADC_CURR_SENSE.c
    /* Enable the active and alternate active power for charge pump clock */
    ADC_CURR_SENSE_PWRMGR_CHARGE_PUMP_CLK_REG |= ADC_CURR_SENSE_ACT_PWR_CHARGE_PUMP_CLK_EN;
    ADC_CURR_SENSE_STBY_PWRMGR_CHARGE_PUMP_CLK_REG |= ADC_CURR_SENSE_STBY_PWR_CHARGE_PUMP_CLK_EN;

    #if(ADC_CURR_SENSE_IRQ_REMOVE == 0u)
        /* Clear a pending interrupt */
        CyIntClearPending(ADC_CURR_SENSE_INTC_NUMBER);
        /* Enable interrupt */
        CyIntEnable(ADC_CURR_SENSE_INTC_NUMBER);
    #endif   /* End ADC_CURR_SENSE_IRQ_REMOVE */

    CyExitCriticalSection(enableInterrupts);

}


/*******************************************************************************
* Function Name: ADC_CURR_SENSE_Start
********************************************************************************
*
* Summary:
*  Performs all required initialization for this component and enables
*  the power. It configure all the register the first time it is called.
*  Subsequent calls of the Start function only enable the ADC and turn
*  on the power. If multiple configurations are selected, it will
*  configure the ADC for configuration 1 by default, unless the
*  ADC_CURR_SENSE_SelectConfiguration( ) function has been called to change
*  the default setting.
*
* Parameters:
*  None
*
* Return:
*  None
*
* Global variables:
*  ADC_CURR_SENSE_initVar:  Used to check the initial configuration,
*  modified when this function is called for the first time.
*
* Side Effects: 
*  Enables internal interrupt.
*
*******************************************************************************/
void ADC_CURR_SENSE_Start(void) 
{
    if(ADC_CURR_SENSE_initVar == 0u)
    {
        if(ADC_CURR_SENSE_started == 0u)
        {
            ADC_CURR_SENSE_Init();
        }
        ADC_CURR_SENSE_initVar = 1u;
    }

    /* Enable the ADC */
    ADC_CURR_SENSE_Enable();
}


/*******************************************************************************
* Function Name: ADC_CURR_SENSE_Stop
********************************************************************************
*
* Summary:
*  This function stops and powers down the ADC component and the internal
*  clock if the external clock is not selected. If an external clock is
*  used, it is up to the designer to power down the external clock it
*  required.
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void ADC_CURR_SENSE_Stop(void) 
{
    uint8 enableInterrupts;
    enableInterrupts = CyEnterCriticalSection();

    /* Stop conversions */
    ADC_CURR_SENSE_DEC_CR_REG &= (uint8)~ADC_CURR_SENSE_DEC_START_CONV;
    ADC_CURR_SENSE_DEC_SR_REG |=  ADC_CURR_SENSE_DEC_INTR_CLEAR;

    /* Disable PRES, Disable power to VCMBUF0, REFBUF0 and REFBUF1,
       enable PRES */
    ADC_CURR_SENSE_RESET_CR4_REG |= ADC_CURR_SENSE_IGNORE_PRESA1;
    ADC_CURR_SENSE_RESET_CR5_REG |= ADC_CURR_SENSE_IGNORE_PRESA2;

    ADC_CURR_SENSE_DSM_CR17_REG &= (uint8)~(ADC_CURR_SENSE_DSM_EN_BUF_VREF | ADC_CURR_SENSE_DSM_EN_BUF_VCM);
    ADC_CURR_SENSE_DSM_REF0_REG &= (uint8)~ADC_CURR_SENSE_DSM_EN_BUF_VREF_INN;

    /* Wait for 3 microseconds. */
    CyDelayUs(ADC_CURR_SENSE_PRES_DELAY_TIME);

    /* Enable the press circuit */
    ADC_CURR_SENSE_RESET_CR4_REG &= (uint8)~ADC_CURR_SENSE_IGNORE_PRESA1;
    ADC_CURR_SENSE_RESET_CR5_REG &= (uint8)~ADC_CURR_SENSE_IGNORE_PRESA2;

    /* Disable power to the ADC */
    ADC_CURR_SENSE_PWRMGR_DSM_REG &= (uint8)~ADC_CURR_SENSE_ACT_PWR_DSM_EN;

    /* Disable power to Decimator block */
    ADC_CURR_SENSE_PWRMGR_DEC_REG &= (uint8)~ADC_CURR_SENSE_ACT_PWR_DEC_EN;

    /* Disable alternative active power to the ADC */
    ADC_CURR_SENSE_STBY_PWRMGR_DEC_REG &= (uint8)~ADC_CURR_SENSE_STBY_PWR_DEC_EN;
    ADC_CURR_SENSE_STBY_PWRMGR_DSM_REG &= (uint8)~ADC_CURR_SENSE_STBY_PWR_DSM_EN;

   /* Disable negative pumps for DSM  */
    ADC_CURR_SENSE_PUMP_CR1_REG &= (uint8)~(ADC_CURR_SENSE_PUMP_CR1_CLKSEL | ADC_CURR_SENSE_PUMP_CR1_FORCE );

    /* This is only valid if there is an internal clock */
    #if(ADC_CURR_SENSE_DEFAULT_INTERNAL_CLK)
        ADC_CURR_SENSE_PWRMGR_CLK_REG &= (uint8)~ADC_CURR_SENSE_ACT_PWR_CLK_EN;
        ADC_CURR_SENSE_STBY_PWRMGR_CLK_REG &= (uint8)~ADC_CURR_SENSE_STBY_PWR_CLK_EN;
    #endif /* ADC_CURR_SENSE_DEFAULT_INTERNAL_CLK */

    /* Disable Modulator Chopping */
    ADC_CURR_SENSE_DSM_CR2_REG &= (uint8)~ADC_CURR_SENSE_DSM_MOD_CHOP_EN;
    /* Disable power to charge pump clock */
    ADC_CURR_SENSE_PWRMGR_CHARGE_PUMP_CLK_REG &= (uint8)~ADC_CURR_SENSE_ACT_PWR_CHARGE_PUMP_CLK_EN;
    ADC_CURR_SENSE_STBY_PWRMGR_CHARGE_PUMP_CLK_REG &= (uint8)~ADC_CURR_SENSE_STBY_PWR_CHARGE_PUMP_CLK_EN;
    
    CyExitCriticalSection(enableInterrupts);
}


/*******************************************************************************
* Function Name: ADC_CURR_SENSE_SetBufferGain
********************************************************************************
*
* Summary:
*  Sets input buffer gain.
*
* Parameters:
*  gain:  Two bit value to select a gain of 1, 2, 4, or 8.
*
* Return:
*  None
*
*******************************************************************************/
void ADC_CURR_SENSE_SetBufferGain(uint8 gain) 
{
    uint8 tmpReg;
    tmpReg = ADC_CURR_SENSE_DSM_BUF1_REG & (uint8)~ADC_CURR_SENSE_DSM_GAIN_MASK;
    tmpReg |= (uint8)(gain << ADC_CURR_SENSE_DSM_GAIN_SHIFT) & ADC_CURR_SENSE_DSM_GAIN_MASK;
    ADC_CURR_SENSE_DSM_BUF1_REG = tmpReg;
}


/*******************************************************************************
* Function Name: ADC_CURR_SENSE_SetCoherency
********************************************************************************
*
* Summary:
*  This function allows the user to change which of the ADC's 3 word
*  result will trigger a coherency unlock. The ADC's result will not be
*  updated until the set byte is read either by the ADC or DMA. 
*  By default the LSB is the coherency byte for right alignment data format. 
*  The middle or high byte is set automatically depend on left alignment 
*  configuration for DMA data transfer.
*  If DMA or if a custom API requires different byte to be read the last,
*  this API should be used to set the last byte of the ADC result that is read. 
*  If a multibyte read is performed either by DMA or the ARM processor, the
*  coherency can be set to any byte in the last word read.
*
* Parameters:
*  coherency:  Two bit value to set the coherency bit.
*           00-Coherency checking off
*           01-low byte is key byte
*           02-middle byte is the key byte
*           03-high byte is the key byte
*
* Return:
*  None
*
*******************************************************************************/
void ADC_CURR_SENSE_SetCoherency(uint8 coherency) 
{
    uint8 tmpReg;

    tmpReg = ADC_CURR_SENSE_DEC_COHER_REG & (uint8)~ADC_CURR_SENSE_DEC_SAMP_KEY_MASK;
    tmpReg |= coherency & ADC_CURR_SENSE_DEC_SAMP_KEY_MASK;
    ADC_CURR_SENSE_DEC_COHER_REG = tmpReg;
}


