SlugSat/3HC/3HC_Firmware/3HC_Firmware_0_1.cydsn/Generated_Source/PSoC5/ADC_CURR_SENSE.c
    Volts = (float32)adcCounts / (float32)ADC_CURR_SENSE_CountsPerVolt;

    return( Volts );
}


/*******************************************************************************
* Function Name: ADC_CURR_SENSE_CountsTo_uVolts
********************************************************************************
*
* Summary:
*  Converts the ADC output to uVolts as a 32-bit integer. For example,
*  if the ADC measured -0.02345 Volts, the return value would be -23450 uVolts.
*
* Parameters:
*  int32 adcCounts: Result from the ADC conversion.
*
* Return:
*  int32:  Result in uVolts
*
* Global variables:
*  ADC_CURR_SENSE_CountsPerVolt:  used to convert ADC counts to mVolts.
*  ADC_CURR_SENSE_Offset:  Used as the offset while converting ADC counts
*   to mVolts.
*
* Theory:
*  Care must be taken to not exceed the maximum value for a 31 bit signed
*  number in the conversion to uVolts and at the same time not lose resolution.
*
*  uVolts = ((A * adcCounts) / ((int32)ADC_CURR_SENSE_CountsPerVolt / B));
*
*******************************************************************************/
int32 ADC_CURR_SENSE_CountsTo_uVolts(int32 adcCounts) 
{

    int32 uVolts;
    int32 coefA;
    int32 coefB;
    uint8 resolution;

    /* Set the resolution based on the configuration */
    /* Convert adcCounts to the right align if left option selected */
    if (ADC_CURR_SENSE_Config == ADC_CURR_SENSE_CFG1)
    {
        resolution = ADC_CURR_SENSE_CFG1_RESOLUTION;
        #if(ADC_CURR_SENSE_CFG1_DEC_DIV != 0)
            adcCounts /= ADC_CURR_SENSE_CFG1_DEC_DIV;
        #endif /* ADC_CURR_SENSE_CFG1_DEC_DIV */
    }
    else if (ADC_CURR_SENSE_Config == ADC_CURR_SENSE_CFG2)
    {
        resolution = ADC_CURR_SENSE_CFG2_RESOLUTION;
        #if(ADC_CURR_SENSE_CFG2_DEC_DIV != 0)
            adcCounts /= ADC_CURR_SENSE_CFG2_DEC_DIV;
        #endif /* ADC_CURR_SENSE_CFG2_DEC_DIV */
    }
    else if (ADC_CURR_SENSE_Config == ADC_CURR_SENSE_CFG3)
    {
        resolution = ADC_CURR_SENSE_CFG3_RESOLUTION;
        #if(ADC_CURR_SENSE_CFG3_DEC_DIV != 0)
            adcCounts /= ADC_CURR_SENSE_CFG3_DEC_DIV;
        #endif /* ADC_CURR_SENSE_CFG3_DEC_DIV */
    }
    else
    {
        resolution = ADC_CURR_SENSE_CFG4_RESOLUTION;
        #if(ADC_CURR_SENSE_CFG4_DEC_DIV != 0)
            adcCounts /= ADC_CURR_SENSE_CFG4_DEC_DIV;
        #endif /* ADC_CURR_SENSE_CFG4_DEC_DIV */
    }

    switch (resolution)
    {
        #if( (ADC_CURR_SENSE_CFG1_RESOLUTION == ADC_CURR_SENSE__BITS_12) || \
             (ADC_CURR_SENSE_CFG2_RESOLUTION == ADC_CURR_SENSE__BITS_12) || \
             (ADC_CURR_SENSE_CFG3_RESOLUTION == ADC_CURR_SENSE__BITS_12) || \
             (ADC_CURR_SENSE_CFG4_RESOLUTION == ADC_CURR_SENSE__BITS_12) )
            case (uint8)ADC_CURR_SENSE__BITS_12:
                coefA = ADC_CURR_SENSE_1UV_COUNTS / ADC_CURR_SENSE_DIVISOR_2;
                coefB = ADC_CURR_SENSE_DIVISOR_2;
                break;
        #endif /* ADC_CURR_SENSE__BITS_12 */    
        #if( (ADC_CURR_SENSE_CFG1_RESOLUTION == ADC_CURR_SENSE__BITS_13) || \
             (ADC_CURR_SENSE_CFG2_RESOLUTION == ADC_CURR_SENSE__BITS_13) || \
             (ADC_CURR_SENSE_CFG3_RESOLUTION == ADC_CURR_SENSE__BITS_13) || \
             (ADC_CURR_SENSE_CFG4_RESOLUTION == ADC_CURR_SENSE__BITS_13) )
            case (uint8)ADC_CURR_SENSE__BITS_13:
                coefA = ADC_CURR_SENSE_1UV_COUNTS / ADC_CURR_SENSE_DIVISOR_4;
                coefB = ADC_CURR_SENSE_DIVISOR_4;
                break;
        #endif /* ADC_CURR_SENSE__BITS_13 */    
        #if( (ADC_CURR_SENSE_CFG1_RESOLUTION == ADC_CURR_SENSE__BITS_14) || \
             (ADC_CURR_SENSE_CFG2_RESOLUTION == ADC_CURR_SENSE__BITS_14) || \
             (ADC_CURR_SENSE_CFG3_RESOLUTION == ADC_CURR_SENSE__BITS_14) || \
             (ADC_CURR_SENSE_CFG4_RESOLUTION == ADC_CURR_SENSE__BITS_14) )
            case (uint8)ADC_CURR_SENSE__BITS_14:
                coefA = ADC_CURR_SENSE_1UV_COUNTS / ADC_CURR_SENSE_DIVISOR_8;
                coefB = ADC_CURR_SENSE_DIVISOR_8;
                break;
        #endif /* ADC_CURR_SENSE__BITS_14 */    
        #if( (ADC_CURR_SENSE_CFG1_RESOLUTION == ADC_CURR_SENSE__BITS_15) || \
             (ADC_CURR_SENSE_CFG2_RESOLUTION == ADC_CURR_SENSE__BITS_15) || \
             (ADC_CURR_SENSE_CFG3_RESOLUTION == ADC_CURR_SENSE__BITS_15) || \
             (ADC_CURR_SENSE_CFG4_RESOLUTION == ADC_CURR_SENSE__BITS_15) )
            case (uint8)ADC_CURR_SENSE__BITS_15:
                coefA = ADC_CURR_SENSE_1UV_COUNTS / ADC_CURR_SENSE_DIVISOR_16;
                coefB = ADC_CURR_SENSE_DIVISOR_16;
                break;
        #endif /* ADC_CURR_SENSE__BITS_15 */    
        #if( (ADC_CURR_SENSE_CFG1_RESOLUTION == ADC_CURR_SENSE__BITS_16) || \
             (ADC_CURR_SENSE_CFG2_RESOLUTION == ADC_CURR_SENSE__BITS_16) || \
             (ADC_CURR_SENSE_CFG3_RESOLUTION == ADC_CURR_SENSE__BITS_16) || \
             (ADC_CURR_SENSE_CFG4_RESOLUTION == ADC_CURR_SENSE__BITS_16) )
            case (uint8)ADC_CURR_SENSE__BITS_16:
                coefA = ADC_CURR_SENSE_1UV_COUNTS / ADC_CURR_SENSE_DIVISOR_32;
                coefB = ADC_CURR_SENSE_DIVISOR_32;
                break;
        #endif /* ADC_CURR_SENSE__BITS_16 */    
        #if( (ADC_CURR_SENSE_CFG1_RESOLUTION == ADC_CURR_SENSE__BITS_17) || \
             (ADC_CURR_SENSE_CFG2_RESOLUTION == ADC_CURR_SENSE__BITS_17) || \
             (ADC_CURR_SENSE_CFG3_RESOLUTION == ADC_CURR_SENSE__BITS_17) || \
             (ADC_CURR_SENSE_CFG4_RESOLUTION == ADC_CURR_SENSE__BITS_17) )
            case (uint8)ADC_CURR_SENSE__BITS_17:
                coefA = ADC_CURR_SENSE_1UV_COUNTS / ADC_CURR_SENSE_DIVISOR_64;
                coefB = ADC_CURR_SENSE_DIVISOR_64;
                break;
        #endif /* ADC_CURR_SENSE__BITS_17 */    
        #if( (ADC_CURR_SENSE_CFG1_RESOLUTION == ADC_CURR_SENSE__BITS_18) || \
             (ADC_CURR_SENSE_CFG2_RESOLUTION == ADC_CURR_SENSE__BITS_18) || \
             (ADC_CURR_SENSE_CFG3_RESOLUTION == ADC_CURR_SENSE__BITS_18) || \
             (ADC_CURR_SENSE_CFG4_RESOLUTION == ADC_CURR_SENSE__BITS_18) )
            case (uint8)ADC_CURR_SENSE__BITS_18:
                coefA = ADC_CURR_SENSE_1UV_COUNTS / ADC_CURR_SENSE_DIVISOR_125;
                coefB = ADC_CURR_SENSE_DIVISOR_125;
                break;
        #endif /* ADC_CURR_SENSE__BITS_18 */    
        #if( (ADC_CURR_SENSE_CFG1_RESOLUTION == ADC_CURR_SENSE__BITS_19) || \
             (ADC_CURR_SENSE_CFG2_RESOLUTION == ADC_CURR_SENSE__BITS_19) || \
             (ADC_CURR_SENSE_CFG3_RESOLUTION == ADC_CURR_SENSE__BITS_19) || \
             (ADC_CURR_SENSE_CFG4_RESOLUTION == ADC_CURR_SENSE__BITS_19) )
            case (uint8)ADC_CURR_SENSE__BITS_19:
                coefA = ADC_CURR_SENSE_1UV_COUNTS / ADC_CURR_SENSE_DIVISOR_250;
                coefB = ADC_CURR_SENSE_DIVISOR_250;
                break;
        #endif /* ADC_CURR_SENSE__BITS_19 */    
        #if( (ADC_CURR_SENSE_CFG1_RESOLUTION == ADC_CURR_SENSE__BITS_20) || \
             (ADC_CURR_SENSE_CFG2_RESOLUTION == ADC_CURR_SENSE__BITS_20) || \
             (ADC_CURR_SENSE_CFG3_RESOLUTION == ADC_CURR_SENSE__BITS_20) || \
             (ADC_CURR_SENSE_CFG4_RESOLUTION == ADC_CURR_SENSE__BITS_20) )
            case (uint8)ADC_CURR_SENSE__BITS_20:
                coefA = ADC_CURR_SENSE_1UV_COUNTS / ADC_CURR_SENSE_DIVISOR_500;
                coefB = ADC_CURR_SENSE_DIVISOR_500;
                break;
        #endif /* ADC_CURR_SENSE__BITS_20 */    
        default:    /* resolution < 12 */
            /* 11 bits ADC + 2^20(1048576) = 31 bits */
            coefA = ADC_CURR_SENSE_1UV_COUNTS;
            coefB = ADC_CURR_SENSE_DIVISOR_1;
            break;
    }
    coefB = ADC_CURR_SENSE_CountsPerVolt / coefB;
    uVolts = ((coefA * adcCounts) / coefB) - ((coefA * ADC_CURR_SENSE_Offset) / coefB);

